Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: SystemTime := Buffer(16) ; This struct consists of 8 UShorts (i.e. 8*2=16).
ja: SystemTime := Buffer(16) ; この構造体は8個のUShortで構成されています。

source: Systems with unusual keyboard drivers might be slow to update the state of their keys, especially the toggle-state of keys like CapsLock.
ja: キーボードドライバが特殊なシステムでは、キーの状態、特にCapsLockのようなキーのトグル状態の更新に時間がかかることがあります。

source: TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION
ja: 複製、頒布、改変に関する条件

source: THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.
ja: 本プログラムの品質および性能に関するすべてのリスクは、お客様が負うものとします。

source: Tab Control Styles
ja: Tabコントロールのスタイル

source: Tab.UseTab() ; i.e. subsequently-added controls will not belong to the tab control.
ja: Tab.UseTab() ; つまり、その後に追加されたコントロールは、タブコントロールに属さない。

source: TabCount := SendMessage(0x1304,,, "SysTabControl321", WinTitle) ; 0x1304 is TCM_GETITEMCOUNT.
ja: TabCount := SendMessage(0x1304,,, "SysTabControl321", WinTitle) ; 0x1304 は TCM_GETITEMCOUNT です。

source: Table of Contents
ja: 目次

source: Tabs appear as buttons, and no border is drawn around the display area.
ja: タブはボタンとして表示され、表示領域の周囲にボーダーは引かれない。

source: Tabs appear at the bottom of the control instead of the top.
ja: タブはコントロールの上部ではなく下部に表示される。

source: Tabs appear at the left side of the control, with tab text displayed vertically.
ja: タブはコントロールの左側に表示され、タブのテキストは縦に表示される。

source: Tabs appear vertically on the right side of controls that use the TCS_VERTICAL style.
ja: タブは、TCS_VERTICALスタイルを使用するコントロールの右側に垂直に表示される。

source: Tabs are expanded, but words are not wrapped.
ja: タブは展開されるが、単語は折り返されない。

source: Tabs that are removed in this way can be added back later, at which time they will reclaim their original set of controls.
ja: この方法で削除されたタブは、後で再び追加することができ、その時は元の操作系を取り戻します。

source: Take a look at the first example in the example section of the Hotstring function's page, which might be useful if you are a heavy user of hotstrings.
ja: Hotstring関数のページのexampleセクションの最初の例を見てみてください。Hotstringのヘビーユーザーであれば役に立つかもしれません。

source: Taking a reference to a built-in variable such as A_Clipboard is currently not supported, except when being passed directly to an OutputVar parameter of a built-in function.
ja: A_Clipboardのような組み込み変数への参照は、組み込み関数のOutputVarパラメータに直接渡される場合を除き、現在サポートされていません。

source: Taking action immediately upon starting the script, and changing default settings.
ja: スクリプトを起動したら即座にアクションを起こし、デフォルト設定を変更する。

source: Target of assignment not a writable variable or property.
ja: 代入対象が書き込み可能な変数やプロパティではありません。

source: Targets a key as described above for RegDeleteKey.
ja: 上記の RegDeleteKey と同様にキーを対象とします。

source: Taskbar Buttons
ja: タスクバーボタン

source: Teal
ja: Teal（ティール）

source: Technically SendText actually sends Unicode character packets and not keystrokes, and that makes it much more reliable for characters that are normally typed with a key-combination like Shift+2 or AltGr+a.
ja: 技術的には、SendTextは実際にはキーストロークではなく、Unicodeの文字パケットを送信するため、Shift+2 or AltGr+aのようなキーコンビネーションで通常入力される文字に対してより信頼性が高くなります。

source: Techniques for dealing with the differences between ANSI and Unicode versions of AutoHotkey can be found under Unicode vs ANSI.
ja: AutoHotkeyのANSI版とUnicode版の違いに対応するためのテクニックは、「Unicode vs ANSI」で紹介されています。

source: Template files are drawn from UX\Templates (preinstalled) and %A_MyDocuments%\AutoHotkey\Templates (user), with a user-defined template overriding any preinstalled template which has the same name.
ja: テンプレートファイルは、UX\Templates（プリインストール）と%A_MyDocuments%\AutoHotkey\Templates（ユーザー）から引かれ、ユーザー定義のテンプレートは、同じ名前を持つプリインストールされたテンプレートを上書きします。

source: Temporarily hides the taskbar.
ja: 一時的にタスクバーを隠します。

source: Temporary Internet Files
ja: インターネット一時ファイル

source: Temporary references returned by functions, methods or operators within an expression are released after evaluation of that expression has completed or been aborted.
ja: 式内の関数、メソッド、または演算子によって返された一時参照は、その式の評価が完了または中止された後に解放されます。

source: Terminate scripts to allow AutoHotkey*.exe to be overwritten.
ja: AutoHotkey*.exeが上書きされるようにスクリプトを終了します。

source: Terminate the script.
ja: スクリプトを終了させます。

source: Terminates the Input and sets EndReason to the word Stopped.
ja: 入力を終了し、EndReasonに Stopped という単語を設定します。

source: Terminates the script.
ja: スクリプトを終了します。

source: Terminating the script is not the same as exiting each thread.
ja: スクリプトの終了は、各スレッドの終了とは異なります。

source: Ternary expressions such as x ? CallIfTrue() : CallIfFalse().
ja: 3項式、x ? CallIfTrue() : CallIfFalse()。

source: Ternary operator with less than three operands.
ja: オペランドが3つ以下の三項演算子。

source: TestString := "This is a test string.`r`n" ; When writing a file this way, use `r`n rather than `n to start a new line.
ja: TestString := "This is a test string.`r`n" ; この方法でファイルを書く場合、改行には `n ではなく `r`n を使用します。

source: Testing has shown that this may improve the reliability of all subsequent attempts, reducing the number of instances where the first attempt fails and causes the taskbar button to flash.
ja: テストによると、最初の試行が失敗してタスクバーボタンが点滅するケースが減り、その後のすべての試行の信頼性が向上する可能性がある。

source: Testing has shown this reduces the occurrence of flashing taskbar buttons.
ja: これにより、タスクバーのボタンが点滅する現象が軽減されることがテストで確認されています。

source: Testing indicates spaces on either side of the pattern (such as after the semi-colon in *.cpp; *.h) are already ignored by the OS, so there should be no negative consequences.
ja: テストでは、パターンの両側にあるスペース（*.cpp; *.hのセミコロンの後など）は、すでにOSによって無視されているので、悪影響はないはずです。

source: Testing shows that due to file caching, a temporary file can be very fast for relatively small outputs.
ja: テストでは、ファイルキャッシュにより、一時ファイルが比較的小さな出力でも非常に高速に動作することが確認されています。

source: Text Control Styles
ja: Textコントロールのスタイル

source: Text assignment
ja: テキスト課題

source: Text color is changed only if specified in Options.
ja: 文字色は、オプションで指定した場合のみ変更されます。

source: Text controls also support the DoubleClick event.
ja: テキストコントロールはDoubleClickイベントにも対応しています。

source: Text displayed in the window to instruct the user what to do.
ja: ウィンドウに表示される、ユーザーに指示を与えるためのテキスト。

source: Text editors with AutoHotkey support
ja: AutoHotkeyに対応したテキストエディタ

source: Text instructions:
ja: テキストの指示：

source: Text is hidden.
ja: テキストは非表示です。

source: Text may include linefeed characters (`n) to start new lines.
ja: テキストには改行文字(`n)を含めることができる。

source: Text mode
ja: テキストモード

source: Text needs to be wrapped in quotes:
ja: テキストは引用符で囲む必要があります：

source: Text performs case-correction, whereas ControlGetText returns the Edit field's content.
ja: Textは大文字・小文字の訂正を行い、ControlGetTextはEditフィールドの内容を返します。

source: Text rendering quality.
ja: テキスト描画の品質。

source: Text retrieved from most control types uses carriage return and linefeed (`r`n) rather than a solitary linefeed (`n) to mark the end of each line.
ja: ほとんどのコントロールタイプから取得したテキストは、各行の終わりを示すために、単独のラインフィード（`n）ではなく、キャリッジリターンとラインフィード（`r`n）を使用します。

source: Text returns the selected item's text, whereas ControlGetText returns hidden text.
ja: Textは選択された項目のテキストを返し、ControlGetTextは非表示のテキストを返します。

source: Text returns the selected tab's text, whereas ControlGetText returns hidden text.
ja: Textは選択されたタブのテキストを返し、ControlGetTextは非表示のテキストを返します。

source: Text that extends past the end of a line is clipped.
ja: 行末からはみ出したテキストは切り取られる。

source: TextBackgroundColor := 0xFFBBBB ; A custom color in BGR format.
ja: TextBackgroundColor := 0xFFBBBB ; BGR 形式のカスタムカラー。

source: Thai
ja: タイ語

source: Thanks to expressions, you can do math!
ja: 式のおかげで数学ができる！

source: Thanks!
ja: ありがとう！

source: That being the case, .NET DLL files are formatted differently to normal DLL files, and generally do not contain any functions which DllCall is capable of calling.
ja: そのため、.NET DLLファイルは通常のDLLファイルとは異なるフォーマットになっており、一般的にDllCallが呼び出せるような関数は含まれていません。

source: That being the case, it would not be possible to fully test any changes aimed at supporting longer executable paths.
ja: そうなると、より長い実行可能パスをサポートすることを目的とした変更を完全にテストすることはできない。

source: That default can be overridden by specifying something such as "Integer Left" or "Float Center".
ja: このデフォルトは、"Integer Left"や"Float Center"などの指定で上書きすることができます。

source: That default may be changed by using this function during script startup.
ja: このデフォルトは、スクリプト起動時にこの関数を使用することで変更することができます。

source: That delay can be changed via SetControlDelay or by assigning a value to A_ControlDelay.
ja: この遅延は、SetControlDelayまたはA_ControlDelayに値を割り当てることで変更できます。

source: That delay can be changed via SetControlDelay.
ja: この遅延はSetControlDelayで変更することができます。

source: That fixes some DirectX issues.
ja: これにより、DirectXのいくつかの問題が修正された。

source: That is FALSE.
ja: それは誤りだ。

source: That is, __Set and property setters are no longer invoked (which would typically only be possible if base is set within the parameter list).
ja: つまり、__Setやプロパティセッターはもはや呼び出されない（これは通常、パラメータリスト内でbaseが設定されている場合にのみ可能である）。

source: That is, LButton is the primary button and RButton is the secondary button, even if the user has swapped the buttons via system settings.
ja: つまり、ユーザーがシステム設定でボタンを入れ替えても、LButtonがプライマリボタン、RButtonがセカンダリボタンになります。

source: That is, Send omits the extra keystrokes that would otherwise be sent in order to prevent:
ja: つまり、Sendは、予防のために送信されるはずの余分なキーストロークを省略します：

source: That is, Send omits the extra keystrokes that would otherwise be sent in order to prevent: 1) Start Menu appearance during Win keystrokes (LWin/RWin); 2) menu bar activation during Alt keystrokes.
ja: つまり、Sendは、予防のために送信されるはずの余分なキーストロークを省略します：1) Winキー操作時のスタートメニュー表示（LWin/RWin）、2) Altキー操作時のメニューバー起動。

source: That is, an error dialog is displayed and __Delete returns, but the thread does not exit (unless it was already exiting).
ja: つまり、エラー・ダイアログが表示され、__Deleteが戻るが、スレッドは終了しない（すでに終了していた場合を除く）。

source: That is, any properties not defined in the object itself can instead be defined in the object's base.
ja: つまり、オブジェクト自体で定義されていないプロパティは、代わりにオブジェクトのベースで定義することができる。

source: That is, any property or method call on a primitive value is delegated to a predefined prototype object, which is also accessible via the Prototype property of the corresponding class.
ja: つまり、プリミティブ値に対するプロパティやメソッドの呼び出しは、定義済みのプロトタイプ・オブジェクトに委譲される。

source: That is, elements lacking a value are still enumerated, and the index is not returned if only one variable is passed.
ja: つまり、値がない要素も列挙され、変数が1つしか渡されない場合はインデックスが返されない。

source: That is, hotkeys which do not require the Win/Alt key no longer mask Win/Alt-up when the Win/Alt key is physically down.
ja: つまり、Win/Altキーを必要としないホットキーは、Win/Altキーが物理的にダウンしているときにWin/Altアップをマスクすることはなくなりました。

source: That is, it can also be the HWND of a top-level window.
ja: つまり、トップレベルウィンドウのHWNDにもなり得るのです。

source: That is, it checks for patterns that are valid only in one of the two major versions.
ja: つまり、2つのメジャーバージョンのどちらかでしか有効でないパターンをチェックする。

source: That is, it highlights the control's buttons as the mouse passes over them.
ja: つまり、マウスがボタンの上を通過すると、コントロールのボタンがハイライトされる。

source: That is, send each character by character code, without translating {Enter} to Enter, ^c to Ctrl+C, etc. and without translating each character to a keystroke.
ja: つまり、{Enter}をEnter、^cをCtrl+Cなどに変換せず、各文字をキーストロークに変換せずに、文字コードで送信します。

source: That is, the length of the return value as reported by StrLen may be 1 or 2.
ja: すなわち、StrLenによって報告される戻り値の長さは、1または2である可能性があります。

source: That limit can be removed by switching to one of the other sending modes, or by using SendPlay or SendEvent in the body of the hotstring or in combination with the X (execute) option.
ja: この制限は、他の送信モードに切り替えるか、ホットストリングの本文でSendPlayまたはSendEventを使用するか、X（実行）オプションと組み合わせることで解除できます。

source: That limit can be removed by switching to one of the other sending modes, or by using SendPlay or SendEvent in the body of the hotstring.
ja: この制限は、他の送信モードに切り替えるか、ホットストリングのボディでSendPlayまたはSendEventを使用することで解除することができます。

source: That means:
ja: これは、以下を意味します：

source: That message's function should use Critical as its first line to ensure that its messages are buffered.
ja: そのメッセージの関数は、メッセージがバッファリングされることを保証するために、その最初の行としてCriticalを使用する必要があります。

source: That will cause A_LoopFilePath to contain the file's path relative to the base folder.
ja: これにより、A_LoopFilePathには、ベースフォルダからの相対的なファイルのパスが含まれることになります。

source: That would be possible only with the help of a controller emulator such as vJoy.
ja: それは、vJoyのようなコントローラー・エミュレーターがあればこそ可能なことだ。

source: That's fancy talk for "do pretty much anything".
ja: これは「何でもできる」という意味の洒落た言葉だ。

source: The "Call" method is implied when calling a value, so need not be explicitly specified.
ja: Call」メソッドは、値を呼び出す際に暗黙の了解となっているため、明示的に指定する必要はない。

source: The "D" option is ignored when "m" is present.
ja: 「D」オプションは「m」があると無視される。

source: The "Exists Since" column indicates the OS version with which the font was introduced.
ja: 「初出のWindowsバージョン」欄は、そのフォントが導入されたOSのバージョンを示します。

source: The "Force" value (4) forces all open applications to close.
ja: 「警告せずに閉じる」（4）は、開いている全てのアプリケーションを強制的に終了します。

source: The "Permit" parameter value is no longer valid.
ja: 「Permit」パラメータ値は無効となりました。

source: The "Power down" value (8) shuts down the system and turns off the power.
ja: 「電源オフ」（8）はシステムをシャットダウンし、電源を切ります。

source: The "Program", below, refers to any such program or work, and a "work based on the Program" means either the Program or any derivative work under copyright law:
ja: 以下の「プログラム」とは、そのようなプログラムまたは著作物を指し、「プログラムに基づく著作物」とは、「プログラム」または著作権法に基づく二次的著作物の いずれかを意味する：

source: The "Program", below, refers to any such program or work, and a "work based on the Program" means either the Program or any derivative work under copyright law: that is to say, a work containing the Program or a portion of it, either verbatim or with modifications and/or translated into another language.
ja: 以下の「プログラム」とは、そのようなプログラムまたは著作物を指し、「プログラムに基づく著作物」とは、「プログラム」または著作権法に基づく二次的著作物の いずれかを意味する：すなわち、『プログラム』またはその一部をそのまま、あるいは改変を加えて、および/または別の言語に翻訳して含む著作物。

source: The "Secondary Logon" service must be set to manual or automatic for this function to work (the OS should automatically start it upon demand if set to manual).
ja: この機能を使用するには、「セカンダリログオン」サービスを手動または自動に設定する必要があります（手動に設定した場合は、要求に応じてOSが自動的に起動する必要があります）。

source: The "Yes" entries in the last column are not authoritative:
ja: 最後の欄の「はい」は権威あるものではない：

source: The "by the way" example above is known as an auto-replace hotstring because the typed text is automatically erased and replaced by the string specified after the second pair of colons.
ja: 上記の「by way」の例は、入力されたテキストが自動的に消去されて2つ目のコロンの後に指定された文字列に置き換えられるため、自動置き換えホットストリングとして知られています。

source: The "current thread" is defined as the flow of execution invoked by the most recent event; examples include hotkeys, SetTimer subroutines, custom menu items, and GUI events.
ja: 「カレント・スレッド」とは、直近のイベントによって呼び出される実行フローと定義される。例としては、ホットキー、SetTimerサブルーチン、カスタム・メニュー・アイテム、GUIイベントなどがある。

source: The "default setting" for one of the above functions usually refers to the current setting of the auto-execute thread, which starts out the same as the program-defined default setting.
ja: 上記の関数の「デフォルト設定」とは、通常、自動実行スレッドの現在の設定を指し、プログラム定義のデフォルト設定と同じように開始される。

source: The "devices" referenced by the SoundGet and SoundSet functions are audio endpoint devices.
ja: SoundGet関数とSoundSet関数が参照する「デバイス」は、オーディオエンドポイントデバイスである。

source: The "index" used to form the final variable name does not have to be numeric; it could instead be a letter or keyword.
ja: 最終的な変数名を形成するために使用される「インデックス」は数値である必要はなく、代わりに文字やキーワードを使用することができます。

source: The "x" option also ignores characters between a non-escaped # outside a character class and the next newline character, inclusive.
ja: 「x」オプションは、文字クラス外のエスケープされていない「#」と次の改行文字の間の文字も無視する。

source: The #ClipboardTimeout directive changes how long the script keeps trying to access the clipboard when the first attempt fails.
ja: #ClipboardTimeoutディレクティブは、クリップボードへのアクセスに失敗した場合に、スクリプトが試行し続ける時間を変更するディレクティブです。

source: The #DllLoad directive loads a DLL or EXE file before the script starts executing.
ja: #DllLoadディレクティブは、スクリプトの実行を開始する前にDLLまたはEXEファイルをロードします。

source: The #ErrorStdOut directive sends any syntax error that prevents a script from launching to the standard error stream (stderr) rather than displaying a dialog.
ja: #ErrorStdOutディレクティブは、スクリプトの起動を妨げる構文エラーを、ダイアログの表示ではなく、標準エラーストリーム（stderr）に送信します。

source: The #HotIf directive creates context-sensitive hotkeys and hotstrings.
ja: #HotIfディレクティブは、コンテキストに応じたホットキーとホットストリングを作成します。

source: The #HotIf directive is positional:
ja: #HotIf指令は位置指定：

source: The #HotIf directive is positional: it affects all hotkeys and hotstrings physically beneath it in the script, until the next #HotIf directive.
ja: #HotIf指令は位置指定：#HotIfは、次の#HotIfディレクティブまで、スクリプト内で物理的にその下にあるすべてのホットキーとホットストリングに影響を及ぼします。

source: The #HotIf directive sets the expression which will be used by subsequently created hotkeys to determine whether they should activate.
ja: #HotIfディレクティブは、その後に作成されるホットキーが起動するかどうかを決定するために使用される式を設定します。

source: The #HotIfTimeout directive sets the maximum time that may be spent evaluating a single #HotIf expression.
ja: #HotIfTimeout指令は、1つの#HotIf式を評価するのにかけられる最大時間を設定します。

source: The #Hotstring directive changes hotstring options or ending characters.
ja: #Hotstringディレクティブは、Hotstringのオプションやエンディングキャラクターを変更します。

source: The #Include and #IncludeAgain directives cause the script to behave as though the specified file's contents are present at this exact position.
ja: #Includeおよび#IncludeAgainディレクティブは、指定されたファイルのコンテンツがこの正確な位置に存在するかのようにスクリプトを動作させるようにします。

source: The #InputLevel directive controls which artificial keyboard and mouse events are ignored by hotkeys and hotstrings.
ja: #InputLevelディレクティブは、ホットキーとホットストリングが、どの人工的なキーボードやマウスイベントを無視するかを制御します。

source: The #MaxThreads directive sets the maximum number of simultaneous threads.
ja: #MaxThreads指令は、最大同時スレッド数を設定します。

source: The #MaxThreadsBuffer directive causes some or all hotkeys to buffer rather than ignore keypresses when their #MaxThreadsPerHotkey limit has been reached.
ja: #MaxThreadsBuffer指令は、いくつかの、またはすべてのホットキーが、#MaxThreadsPerHotkeyの制限に達した場合、キー入力を無視するのではなく、バッファリングするようにします。

source: The #MaxThreadsPerHotkey directive sets the maximum number of simultaneous threads per hotkey or hotstring.
ja: #MaxThreadsPerHotkey指令は、ホットキーまたはホットストリングごとの最大同時スレッド数を設定します。

source: The #NoTrayIcon directive disables the showing of a tray icon.
ja: #NoTrayIconディレクティブは、トレイアイコンの表示を無効にするディレクティブです。

source: The #Requires directive displays an error and quits if a version requirement is not met.
ja: #Requiresディレクティブは、バージョン要件を満たさないときにエラーを表示して終了します。

source: The #SingleInstance directive determines whether a script is allowed to run again when it is already running.
ja: #SingleInstanceディレクティブは、スクリプトがすでに実行されているときに、再実行を許可するかどうかを決定します。

source: The #SuspendExempt directive exempts subsequent hotkeys and hotstrings from suspension.
ja: #SuspendExempt指令は、それ以降のホットキーとホットストリングをサスペンドから除外します。

source: The #UseHook directive forces the use of the hook to implement all or some keyboard hotkeys.
ja: #UseHookディレクティブは、すべてまたは一部のキーボードホットキーを実装するためにフックを使用することを強制します。

source: The #Warn directive enables or disables warnings for specific conditions which may indicate an error, such as a typo or missing "global" declaration.
ja: #Warn指令は、タイポやglobal宣言の欠落など、エラーを示す可能性のある特定の条件について警告を有効または無効にします。

source: The #WinActivateForce directive skips the gentle method of activating a window and goes straight to the forceful method.
ja: #WinActivateForceディレクティブは、ウィンドウをアクティブにする穏やかな方法をスキップして、強引な方法に直行します。

source: The $ prefix forces the keyboard hook to be used to implement this hotkey, which as a side-effect prevents the Send function from triggering it.
ja: 接頭辞の$は、このホットキーの実装にキーボードフックを使用することを強制し、副作用としてSend関数がトリガーするのを防ぎます。

source: The $ prefix has no effect for mouse hotkeys, since they always use the mouse hook.
ja: $ 接頭辞は、マウスホットキーは常にマウスフックを使用するため、$ 接頭辞はマウスホットキーには影響しません。

source: The $ prefix is equivalent to having specified #UseHook somewhere above the definition of this hotkey.
ja: $ 接頭辞は、#UseHookを指定したのと同じです。 このホットキーの定義の上のどこかにあります。

source: The $ prefix is needed to prevent a warning dialog about an infinite loop (since the hotkey "sends itself").
ja: プレフィックス$は、無限ループに関する警告ダイアログを防ぐために必要です（ホットキーが「自分自身を送信」するため）。

source: The (undocumented?) "lazy var" optimization was removed to reduce code size and maintenance costs.
ja: コードサイズとメンテナンスコストを削減するために、(文書化されていない？)「lazy var」最適化が削除されました。

source: The *.bin or *.exe file to use.
ja: 使用する*.binまたは*.exeファイル。

source: The +HwndVarName option has been removed in favour of GuiCtrl.Hwnd.
ja: GuiCtrl.Hwndの代わりに、+HwndVarNameオプションが削除されました。

source: The .bin file to be used.
ja: 使用する .bin ファイル。

source: The /ErrorStdOut switch can be used to suppress or capture the error message.
ja: /ErrorStdOutスイッチを使用すると、エラーメッセージを表示しないことも、表示することもできる。

source: The /R and /F switches were removed.
ja: Rと/Fのスイッチは削除されました。

source: The 12 or more function keys at the top of most keyboards.
ja: ほとんどのキーボードの上部にある12個以上のファンクションキーです。

source: The 2-digit day of the month (01-31)
ja: 月の2桁の日付（01～31）です

source: The 2-digit hour in 24-hour format (00-23).
ja: 24時間表示の2桁の時間（00～23）です。

source: The 2-digit minutes (00-59)
ja: 2桁の分（00～59）です

source: The 2-digit month (01-12)
ja: 2桁の月（01～12）です

source: The 2-digit seconds (00-59)
ja: 2桁の秒（00～59）です

source: The 4-digit year
ja: 4桁の西暦

source: The 5th and 6th axes of the joystick.
ja: ジョイスティックの5軸目と6軸目です。

source: The 8.3 short name or alternate name of the file.
ja: 8.3ショートネーム、またはファイルの代替名。

source: The 8.3 short name, or alternate name of the file.
ja: 8.3ショートネーム、またはファイルの代替名。

source: The 8.3 short path and name of the file/folder currently retrieved.
ja: 現在検索しているファイル／フォルダの 8.3 ショートパスと名前。

source: The "three-key combination" Hotkey example uses this mode of HotIf.
ja: 「3キーの組み合わせ」Hotkeyの例では、このモードのHotIfを使用しています。

source: The #HotIf directive can be used to make a hotkey perform a different action (or none at all) depending on a specific condition.
ja: #HotIfディレクティブを使用すると、特定の条件によってホットキーに異なる動作をさせることができます（または全くさせないこともできます）。

source: The #HotIf directive can be used to make selected controller buttons perform a different action (or none at all) depending on any condition, such as the type of window that is active.
ja: #HotIfディレクティブを使用すると、アクティブなウィンドウの種類などの条件に応じて、選択したコントローラのボタンに異なるアクションを実行させることができます。

source: The #HotIf directive can be used to make selected hotstrings context sensitive.
ja: #HotIfディレクティブを使用することで、選択したホットストリングをコンテキストセンシティブにすることができます。

source: The #HotIf directive can be used to make selected remappings active only in the windows you specify (or while any given condition is met).
ja: #HotIfディレクティブは、選択したリマッピングを指定したウィンドウでのみ（または指定した条件が満たされている間）有効にするために使用できます。

source: The #HotIf directive can be used to specify a condition that must be met for the hotkey to activate, such as:
ja: #HotIfディレクティブは、以下のように、ホットキーが有効になるために満たすべき条件を指定するために使用することができます：

source: The #Hotstring directive, which affects all hotstrings physically beneath that point in the script.
ja: スクリプトのそのポイントより物理的に下のすべてのホットストリングに影響を与える#Hotstringディレクティブです。

source: The #Include directive causes the script to behave as though the specified file's contents are present at this exact position.
ja: #Include指令は、指定されたファイルの内容がこの正確な位置に存在するかのようにスクリプトを動作させるものです。

source: The #Include directive may be used to load functions from an external file.
ja: #Include指令は、外部ファイルから関数をロードするために使用することができます。

source: The *= and /= operators are a shorthand way to multiply or divide the value in a variable by another value.
ja: 演算子 *= と /=は、変数の値を別の値で乗算または除算する省略記法である。

source: The /ErrorStdOut switch can be used to suppress or capture any error messages.
ja: ErrorStdOutスイッチを使用すると、エラーメッセージを抑止またはキャプチャすることができる。

source: The BlockInput function can be used to prevent any physical mouse activity by the user from disrupting the simulated mouse events produced by the mouse functions.
ja: BlockInput関数を使用すると、ユーザーによる物理的なマウス操作が、マウス関数によって生成されるシミュレーションマウスイベントを妨害することを防ぐことができます。

source: The Buffer object is recommended for this purpose.
ja: この目的には、Bufferオブジェクトが推奨されます。
